simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogicoTest/AcondicionamientoAnalogico.cydsn/calibration.c
uint8 psoc_calibration_stage_count(void)
{
    return PSOC_CAL_STAGE_COUNT;
}

void psoc_calibration_seed_dac(const uint8 *dac_values, uint8 count)
{
    uint8 i;
    for (i = 0u; i < count && i < PSOC_CAL_STAGE_COUNT; i++) {
        cal_stage_write_result(i, dac_values[i]);
    }
}

void psoc_calibration_report_adc_snapshot(void)
{
    uint8 i;

    cal_diag(PSOC_EVT_BOOT, PSOC_HW_CLASS);

    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        const PsocCalStage *stage = &g_psoc_cal_stages[i];
        uint8 saved_dac = cal_stage_current_dac(i);

        ADC_Stop();
        CAL_AMUX_ADC_SELECT(stage->adc_channel);
        ADC_Start();

        stage->write(saved_dac);
        CyDelay(CAL_DIAG_SWEEP_SETTLE_MS);
        cal_diag(PSOC_EVT_ADC_SNAPSHOT_BEGIN, i);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_TARGET32, stage->target_counts);
        cal_diag(PSOC_EVT_CAL_STAGE_DAC, saved_dac);
        cal_diag_i32(PSOC_EVT_ADC_RAW32, cal_adc_read_direct_counts());

#if CAL_DIAG_SWEEP_ENABLE
        cal_diag_sweep_stage(stage);
        stage->write(saved_dac);
        CyDelay(CAL_DIAG_SWEEP_SETTLE_MS);
        cal_diag(PSOC_EVT_CAL_STAGE_DAC, saved_dac);
        cal_diag_i32(PSOC_EVT_ADC_RAW32, cal_adc_read_direct_counts());
#endif
    }

    psoc_calibration_restore_capture_path();
}

#if CAL_ALGO_SERVO_ENABLE /* servo lento legacy -- ver nota junto a CAL_SERVO_IDLE mas arriba.
       * psoc_calibration_servo_enable/enabled/abort/service (API publica,
       * llamada desde main.c) tienen stubs no-op mas abajo; sus cuerpos
       * reales (que usaban estas funciones) tambien quedaron comentados,
       * ver el segundo bloque "#if 0 -- servo lento legacy". */
static uint8 cal_servo_apply_measurement(uint8 stage_index, uint8 dac, int32 measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[stage_index];
    const PsocCalServoTune *tune = &g_cal_servo_tune[stage_index];
    PsocCalResult *result = &g_psoc_cal_results[stage_index];
    int32 error = stage->target_counts - measured;
    int32 abs_error = abs_counts(error);
    int8 dir;
    uint8 step;
    int16 next;
    uint8 slope_increasing;

    result->final_measured = measured;
    result->ok = (abs_error <= stage->tolerance_counts) ? 1u : 0u;

    if (g_cal_servo.have_last[stage_index] &&
        g_cal_servo.last_dac[stage_index] != dac &&
        g_cal_servo.last_measured[stage_index] != measured) {
        slope_increasing =
            ((measured > g_cal_servo.last_measured[stage_index]) ==
             (dac > g_cal_servo.last_dac[stage_index])) ? 1u : 0u;
        g_cal_servo.increasing[stage_index] = slope_increasing;
        g_cal_servo.have_slope[stage_index] = 1u;
    }

    if (abs_error <= tune->deadband_counts) {
        g_cal_servo.integral[stage_index] /= 2L;
        g_cal_servo.trial_active[stage_index] = 0u;
        g_cal_servo.have_last[stage_index] = 1u;
        g_cal_servo.last_dac[stage_index] = dac;
        g_cal_servo.last_measured[stage_index] = measured;
        return 1u;
    }

    if (g_cal_servo.trial_active[stage_index] &&
        abs_error > (g_cal_servo.prev_abs_error[stage_index] +
                     CAL_SERVO_WORSE_HYST_COUNTS) &&
        g_cal_servo.last_dir[stage_index] != 0) {
        uint8 restore_dac = g_cal_servo.last_dac[stage_index];
        cal_stage_write_result(stage_index, restore_dac);
        result->final_measured = g_cal_servo.last_measured[stage_index];
        result->ok = (g_cal_servo.prev_abs_error[stage_index] <=
                      stage->tolerance_counts) ? 1u : 0u;
        g_cal_servo.integral[stage_index] = 0L;
        g_cal_servo.trial_active[stage_index] = 0u;
        cal_diag(PSOC_EVT_CAL_LOOP, restore_dac);
        return 1u;
    } else {
        int32 control;
        uint8 assume_increasing;

        g_cal_servo.integral[stage_index] =
            cal_servo_clip_integral(g_cal_servo.integral[stage_index] + error);
        control = (error * tune->kp_num) +
            ((g_cal_servo.integral[stage_index] * tune->ki_num) /
             ((tune->ki_div == 0L) ? 1L : tune->ki_div));
        if (control == 0L) {
            control = error;
        }

        assume_increasing = g_cal_servo.have_slope[stage_index]
            ? g_cal_servo.increasing[stage_index]
            : ((stage->direction >= 0) ? 1u : 0u);
        if (assume_increasing) {
            dir = (control > 0L) ? 1 : -1;
        } else {
            dir = (control > 0L) ? -1 : 1;
        }
    }

    step = (abs_error > CAL_OPERATING_RANGE_COUNTS)
        ? tune->recovery_step
        : tune->fine_step;
    next = (int16)dac + (int16)((int16)dir * (int16)step);
    if (next < (int16)cal_stage_min_dac(stage)) {
        next = (int16)cal_stage_min_dac(stage);
    }
    if (next > (int16)cal_stage_max_dac(stage)) {
        next = (int16)cal_stage_max_dac(stage);
    }

    g_cal_servo.have_last[stage_index] = 1u;
    g_cal_servo.last_dac[stage_index] = dac;
    g_cal_servo.last_measured[stage_index] = measured;

    if ((uint8)next != dac) {
        if (g_cal_servo.trial_active[stage_index] &&
            (uint8)next == g_cal_servo.prev_dac[stage_index]) {
            g_cal_servo.integral[stage_index] = 0L;
            g_cal_servo.trial_active[stage_index] = 0u;
            cal_diag(PSOC_EVT_CAL_LOOP, (uint8)next);
            return 1u;
        }
        g_cal_servo.prev_dac[stage_index] = dac;
        g_cal_servo.prev_abs_error[stage_index] = abs_error;
        g_cal_servo.last_dir[stage_index] = dir;
        g_cal_servo.trial_active[stage_index] = 1u;
        cal_stage_write_result(stage_index, (uint8)next);
        cal_diag(PSOC_EVT_SERVO_STEP, (uint8)next);
        return 0u;
    } else {
        g_cal_servo.trial_active[stage_index] = 0u;
        return 1u;
    }
}

static void cal_servo_measure_begin(uint8 stage_index)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[stage_index];

    g_cal_servo.stage_index = stage_index;
    g_cal_servo.dac = cal_stage_current_dac(stage_index);
    g_cal_servo.acc = 0L;
    g_cal_servo.cum_sum = 0L;
    g_cal_servo.cum_count = 0L;
    g_cal_servo.prev_avg = 0L;
    g_cal_servo.avg_count = 0u;
    g_cal_servo.discard_count = cal_servo_settle_samples(stage_index);
    g_cal_servo.settle_windows = 0u;
    g_cal_servo.have_prev_avg = 0u;
    g_cal_servo.empty_polls = 0UL;

    ADC_Stop();
    CAL_AMUX_ADC_SELECT_STAGE(stage->adc_channel);
    cal_diag(PSOC_EVT_CAL_AMUX_IN, stage->adc_channel);
#if CAL_AMUX_HAS_CAP_CHANNEL
    cal_diag(PSOC_EVT_CAL_AMUX_CAP, CAL_AMUX_CAP_CHANNEL);
#endif
    ADC_Start();
#ifdef CY_ISR_isr_DMA_DelSig_RAM_H
    isr_DMA_DelSig_RAM_ClearPending();
#endif
    psoc_adc_clear_isr_sample();
    ADC_StartConvert();
    cal_diag(PSOC_EVT_SERVO_STAGE, stage_index);
    g_cal_servo.state = CAL_SERVO_MEASURE;
}

static uint8 cal_servo_measure_service(void)
{
    int32 sample;
    int32 cum_avg;
    uint8 stage_index = g_cal_servo.stage_index;

