simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogicoTest/AcondicionamientoAnalogico.cydsn/calibration.c
    if (!psoc_adc_take_isr_sample(&sample)) {
        g_cal_servo.empty_polls++;
        if (g_cal_servo.empty_polls >= CAL_ASYNC_EMPTY_POLL_LIMIT) {
            g_cal_servo.state = CAL_SERVO_IDLE;
            psoc_calibration_restore_capture_path();
            return 1u;
        }
        return 0u;
    }

    g_cal_servo.empty_polls = 0UL;
    if (g_cal_servo.discard_count > 0u) {
        g_cal_servo.discard_count--;
        return 0u;
    }

    g_cal_servo.acc += sample;
    g_cal_servo.avg_count++;
    if (g_cal_servo.avg_count < CAL_SERVO_AVG_N) {
        return 0u;
    }

    g_cal_servo.cum_sum += g_cal_servo.acc;
    g_cal_servo.cum_count += (int32)CAL_SERVO_AVG_N;
    g_cal_servo.acc = 0L;
    g_cal_servo.avg_count = 0u;

    cum_avg = g_cal_servo.cum_sum / g_cal_servo.cum_count;
    if (g_cal_servo.have_prev_avg &&
        abs_counts(cum_avg - g_cal_servo.prev_avg) <= CAL_SERVO_SETTLE_TOL_COUNTS) {
        uint8 locked;
        cal_diag(PSOC_EVT_CAL_STAGE_DAC, g_cal_servo.dac);
        cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, cum_avg);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, cum_avg);
        locked = cal_servo_apply_measurement(stage_index, g_cal_servo.dac, cum_avg);
        psoc_calibration_restore_capture_path();
        if (locked) {
            g_cal_servo.stage_index = (uint8)((stage_index + 1u) % PSOC_CAL_STAGE_COUNT);
        }
        g_cal_servo.next_due_ticks = psoc_now_ticks() + CAL_SERVO_PERIOD_TICKS;
        g_cal_servo.state = CAL_SERVO_IDLE;
        return 1u;
    }

    g_cal_servo.prev_avg = cum_avg;
    g_cal_servo.have_prev_avg = 1u;
    g_cal_servo.settle_windows++;
    if (g_cal_servo.settle_windows >= CAL_SERVO_SETTLE_MAX_WINDOWS) {
        uint8 locked;
        cal_diag(PSOC_EVT_CAL_STAGE_DAC, g_cal_servo.dac);
        cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, cum_avg);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, cum_avg);
        locked = cal_servo_apply_measurement(stage_index, g_cal_servo.dac, cum_avg);
        psoc_calibration_restore_capture_path();
        if (locked) {
            g_cal_servo.stage_index = (uint8)((stage_index + 1u) % PSOC_CAL_STAGE_COUNT);
        }
        g_cal_servo.next_due_ticks = psoc_now_ticks() + CAL_SERVO_PERIOD_TICKS;
        g_cal_servo.state = CAL_SERVO_IDLE;
        return 1u;
    }

    return 0u;
}
#endif /* #if 0 -- servo lento legacy */

void psoc_calibration_start_references(void)
{
    uint8 i;

    CAL_AMUX_ADC_START();
    ADC_Stop();
    CAL_AMUX_ADC_SELECT(CAL_ADC_CAPTURE_CHANNEL);
    ADC_Start();
    ADC_StopConvert();

#if PSOC_HW_CLASS == PSOC_HW_GEO
    VDAC_ref_PGA_Start();
#if defined(VDAC_ref_BP_DEFAULT_DATA) || defined(CY_DVDAC_VDAC_ref_BP_H)
    VDAC_ref_BP_Start();
#endif
    VDAC_Ref_Sum_Start();
    VDAC_ref_LP_Start();
#else
    VDAC_PGA_Start();
    VDAC_LP_Start();
#endif

    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        uint8 center = cal_stage_center_dac(&g_psoc_cal_stages[i]);
        g_psoc_cal_stages[i].write(center);
        g_psoc_cal_results[i].final_dac = center;
        g_psoc_cal_results[i].final_measured = 0L;
        g_psoc_cal_results[i].ok = 1u;
    }
    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
}

/* Deja el AMux_ADC en el canal de captura (GEO_LP): este es el estado IDLE,
 * en el que el ADC queda mirando GEO_LP para poder verificar en cualquier
 * momento si el front-end sigue calibrado. */
void psoc_calibration_restore_capture_path(void)
{
    ADC_Stop();
    CAL_AMUX_ADC_SELECT(CAL_ADC_CAPTURE_CHANNEL);
    ADC_Start();
    ADC_StopConvert();
}

void psoc_calibration_reset_references(void)
{
    uint8 i;

    ADC_Stop();
    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        uint8 center = cal_stage_center_dac(&g_psoc_cal_stages[i]);
        g_psoc_cal_stages[i].write(center);
        g_psoc_cal_results[i].final_dac = center;
        g_psoc_cal_results[i].final_measured = 0L;
        g_psoc_cal_results[i].ok = 1u;
    }
    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
    psoc_calibration_restore_capture_path();
}

void psoc_calibration_seed_default_dac(void)
{
    uint8 i;

    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        uint8 center = cal_stage_center_dac(&g_psoc_cal_stages[i]);
        g_psoc_cal_stages[i].write(center);
        g_psoc_cal_results[i].final_dac = center;
        g_psoc_cal_results[i].final_measured = 0L;
        g_psoc_cal_results[i].ok = 1u;
    }
    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
}

#if CAL_ALGO_SERVO_ENABLE /* servo lento legacy -- comentado a pedido del usuario (calibracion
       * pasa a ser PI-only, ver bloque "Controlador PI de calibracion" mas
       * abajo). Stubs no-op de la API publica justo despues de este bloque. */
void psoc_calibration_servo_enable(uint8 enable)
{
    g_cal_servo.enabled = enable ? 1u : 0u;
    if (!g_cal_servo.enabled) {
        psoc_calibration_servo_abort();
    } else {
        g_cal_servo.next_due_ticks = psoc_now_ticks();
    }
}

uint8 psoc_calibration_servo_enabled(void)
{
    return g_cal_servo.enabled;
}

void psoc_calibration_servo_abort(void)
{
    if (g_cal_servo.state == CAL_SERVO_MEASURE) {
        ADC_StopConvert();
        psoc_calibration_restore_capture_path();
    }
    g_cal_servo.state = CAL_SERVO_IDLE;
    g_cal_servo.next_due_ticks = psoc_now_ticks() + CAL_SERVO_PERIOD_TICKS;
}

uint8 psoc_calibration_servo_service(void)
{
    if (!g_cal_servo.enabled || g_cal_async.busy) {
        return 0u;
    }

    if (g_cal_servo.state == CAL_SERVO_IDLE) {
        uint32 now = psoc_now_ticks();
        if ((int32)(now - g_cal_servo.next_due_ticks) >= 0) {
            cal_servo_measure_begin(g_cal_servo.stage_index);
        }
        return 0u;
    }

    return cal_servo_measure_service();
}
#endif /* #if 0 -- servo lento legacy */

/* Stubs no-op: el servo lento de mantenimiento esta comentado (arriba) a
 * pedido del usuario -- calibracion es 100% PI ahora. Se mantiene la firma
 * publica porque main.c los llama incondicionalmente. */
void psoc_calibration_servo_enable(uint8 enable)
{
    (void)enable;
}

uint8 psoc_calibration_servo_enabled(void)
{
    return 0u;
}

void psoc_calibration_servo_abort(void)
{
}

uint8 psoc_calibration_servo_service(void)
{
    return 0u;
}

/* Compartido con cal_pi_finish_stage -- cierra la corrida de calibracion
 * (restaura AMux/captura, re-habilita isr_SyncIn) sin importar que
 * controlador la corrio. */
static void cal_async_complete(void)
{
    psoc_cal_timer_stop();
    ADC_Stop();
    psoc_amux_capacitor_cleanup();
    psoc_amux_disconnect_capacitor();
    psoc_calibration_restore_capture_path();
    /* Restaura el FIR de adquisicion -- cal_pi_start() cargo el de
     * calibracion al empezar esta corrida; fuera de una calibracion el
     * Filter de hardware debe volver a tener el diseño de adquisicion. */
    (void)psoc_filter_load_fir_coefficients(g_fir_adquisition_coeffs_q23, FILTER_FIR_NTAPS);
#if defined(SYNC_IN_INTSTAT)
    (void)SYNC_IN_ClearInterrupt();
#endif
#ifdef CY_ISR_isr_SyncIn_H
    isr_SyncIn_ClearPending();
    isr_SyncIn_Enable();
#endif
    g_cal_async.busy = 0u;
    g_cal_async.done = 1u;
    g_cal_async.state = CAL_ASYNC_DONE;
}

