simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogicoTest/AcondicionamientoAnalogico.cydsn/calibration.c
/* Aborta la calibracion por timeout global. Las etapas ya finalizadas se
 * conservan; la etapa en curso y las pendientes vuelven al adelanto nominal. */
static void cal_async_abort_watchdog(void)
{
    uint8 i;

    for (i = g_cal_async.stage_index; i < PSOC_CAL_STAGE_COUNT; i++) {
        uint8 center = cal_stage_center_dac(&g_psoc_cal_stages[i]);
        g_psoc_cal_stages[i].write(center);
        g_psoc_cal_results[i].final_dac = center;
        g_psoc_cal_results[i].final_measured = 0L;
        g_psoc_cal_results[i].ok = 0u;
    }
    g_cal_async.ok = 0u;
    cal_diag(PSOC_EVT_CAL_WATCHDOG, g_cal_async.stage_index);

    cal_async_complete();
}

/* ============================================================
 * Controlador PI de calibracion: unico algoritmo activo. Puerto directo de
 * Subsystem_step() en
 * modelado/matlab/Simulaciones Controladores/Desacople/Subsystem_grt_rtw/Subsystem.c
 * -- ESE es el diseño de referencia, no una variacion: misma ley PI
 * posicional, sin paso de "refine"/promediado al cerrar la etapa. Toda
 * la suavizacion viene del FIR de hardware (Filter, FIR_calibration.h) leido
 * via DMA_Filter_RAM -- nunca un promedio de software.
 *
 * Superficie de ajuste por etapa, A PROPOSITO reducida a esto y nada mas
 * (ver calibration_tables_{geo,hammer}_*.h): Kp (num/div), Ki (num/div),
 * ganancia absoluta VDAC->medida y samples para lock (M muestras en la misma
 * celda de error cuantizado). target_mv y adelanto_mv son aparte (planteo del
 * problema, no ganancias del algoritmo).
 *
 * Reutiliza g_cal_async.busy/done/ok/stage_index y los flags de Timer_3
 * cal_async_complete/cal_async_abort_watchdog tal cual: para el resto del
 * firmware (EEPROM, diagnostico UART, ESP/web) mantiene la misma API externa.
 * ============================================================ */

typedef enum {
    CAL_PI_STAGE_BEGIN = 0u,
    CAL_PI_SETTLE,
    CAL_PI_RUN,
    CAL_PI_REFINE_SETTLE
} PsocCalPiState;

typedef struct {
    int32 kp_num;
    int32 kp_div;
    int32 ki_num;
    int32 ki_div;
    int32 gain_x1000;       /* ganancia fija VDAC->medida; 0 = dinamica por etapa */
    int32 deadband_dac;     /* Delta_i usado; 0 = derivar del piso fisico */
    uint16 lock_samples;    /* M muestras en la misma celda de error */
    uint16 settle_samples;  /* espera inicial del FIR al cambiar AMux/VDAC */
    uint16 timeout_samples; /* techo de muestras de PI para esta etapa */
    uint8 refine_enable;    /* prueba final de +/-1 codigo VDAC */
    uint16 refine_settle_samples;
} PsocCalPiCfg;

typedef struct {
    PsocCalPiState state;
    int32 integral;
    int32 last_fir_output;
    int32 last_error_dac;
    int32 last_error_bucket;
    uint16 samples_taken;
    uint16 stable_count;
    uint16 settle_remaining;
    int32 refine_base_measured;
    int32 refine_base_abs_error;
    uint8 refine_base_dac;
    uint8 refine_trial_dac;
    uint8 refine_ok;
    uint8 have_last_error;
    uint8 last_dac_target;
    uint8 base_dac;
    uint8 dac_current;
    uint32 empty_polls;
} PsocCalPi;

static PsocCalPi g_cal_pi;

/* Division entera con redondeo al mas cercano (no truncado hacia 0). */
static int32 cal_round_div_i64(int64 num, int64 den)
{
    int64 half;

    if (den == 0LL) {
        den = 1LL;
    }
    half = (den < 0LL) ? -den / 2LL : den / 2LL;
    if ((num < 0LL) != (den < 0LL)) {
        return (num - half) / den;
    }
    return (num + half) / den;
}

static int32 cal_pi_clip_integral(int32 value)
{
    if (value > CAL_PI_INTEGRAL_LIMIT) { return CAL_PI_INTEGRAL_LIMIT; }
    if (value < -CAL_PI_INTEGRAL_LIMIT) { return -CAL_PI_INTEGRAL_LIMIT; }
    return value;
}

#if PSOC_HW_CLASS == PSOC_HW_GEO
static const PsocCalPiCfg g_cal_pi_cfg[PSOC_CAL_STAGE_COUNT] = {
    { CAL_PI_KP_NUM_GEO_PGA, CAL_PI_KP_DIV_GEO_PGA, CAL_PI_KI_NUM_GEO_PGA, CAL_PI_KI_DIV_GEO_PGA, CAL_PI_GAIN_GEO_PGA_X1000, CAL_PI_DEADBAND_GEO_PGA_DAC_CODES, CAL_PI_LOCK_SAMPLES_GEO_PGA, CAL_PI_SETTLE_SAMPLES_GEO_PGA, CAL_PI_TIMEOUT_SAMPLES_GEO_PGA, CAL_PI_REFINE_ENABLE_GEO_PGA, CAL_PI_REFINE_SETTLE_SAMPLES_GEO_PGA },
#if defined(VDAC_ref_BP_DEFAULT_DATA) || defined(CY_DVDAC_VDAC_ref_BP_H)
    { CAL_PI_KP_NUM_GEO_BP, CAL_PI_KP_DIV_GEO_BP, CAL_PI_KI_NUM_GEO_BP, CAL_PI_KI_DIV_GEO_BP, CAL_PI_GAIN_GEO_BP_X1000, CAL_PI_DEADBAND_GEO_BP_DAC_CODES, CAL_PI_LOCK_SAMPLES_GEO_BP, CAL_PI_SETTLE_SAMPLES_GEO_BP, CAL_PI_TIMEOUT_SAMPLES_GEO_BP, CAL_PI_REFINE_ENABLE_GEO_BP, CAL_PI_REFINE_SETTLE_SAMPLES_GEO_BP },
#endif
    { CAL_PI_KP_NUM_GEO_SUM, CAL_PI_KP_DIV_GEO_SUM, CAL_PI_KI_NUM_GEO_SUM, CAL_PI_KI_DIV_GEO_SUM, CAL_PI_GAIN_GEO_SUM_X1000, CAL_PI_DEADBAND_GEO_SUM_DAC_CODES, CAL_PI_LOCK_SAMPLES_GEO_SUM, CAL_PI_SETTLE_SAMPLES_GEO_SUM, CAL_PI_TIMEOUT_SAMPLES_GEO_SUM, CAL_PI_REFINE_ENABLE_GEO_SUM, CAL_PI_REFINE_SETTLE_SAMPLES_GEO_SUM },
    { CAL_PI_KP_NUM_GEO_LP, CAL_PI_KP_DIV_GEO_LP, CAL_PI_KI_NUM_GEO_LP, CAL_PI_KI_DIV_GEO_LP, CAL_PI_GAIN_GEO_LP_X1000, CAL_PI_DEADBAND_GEO_LP_DAC_CODES, CAL_PI_LOCK_SAMPLES_GEO_LP, CAL_PI_SETTLE_SAMPLES_GEO_LP, CAL_PI_TIMEOUT_SAMPLES_GEO_LP, CAL_PI_REFINE_ENABLE_GEO_LP, CAL_PI_REFINE_SETTLE_SAMPLES_GEO_LP },
};
#else
static const PsocCalPiCfg g_cal_pi_cfg[PSOC_CAL_STAGE_COUNT] = {
    { CAL_PI_KP_NUM_HAMMER_PGA, CAL_PI_KP_DIV_HAMMER_PGA, CAL_PI_KI_NUM_HAMMER_PGA, CAL_PI_KI_DIV_HAMMER_PGA, CAL_PI_GAIN_HAMMER_PGA_X1000, CAL_PI_DEADBAND_HAMMER_PGA_DAC_CODES, CAL_PI_LOCK_SAMPLES_HAMMER_PGA, CAL_PI_SETTLE_SAMPLES_HAMMER_PGA, CAL_PI_TIMEOUT_SAMPLES_HAMMER_PGA, CAL_PI_REFINE_ENABLE_HAMMER_PGA, CAL_PI_REFINE_SETTLE_SAMPLES_HAMMER_PGA },
    { CAL_PI_KP_NUM_HAMMER_LP, CAL_PI_KP_DIV_HAMMER_LP, CAL_PI_KI_NUM_HAMMER_LP, CAL_PI_KI_DIV_HAMMER_LP, CAL_PI_GAIN_HAMMER_LP_X1000, CAL_PI_DEADBAND_HAMMER_LP_DAC_CODES, CAL_PI_LOCK_SAMPLES_HAMMER_LP, CAL_PI_SETTLE_SAMPLES_HAMMER_LP, CAL_PI_TIMEOUT_SAMPLES_HAMMER_LP, CAL_PI_REFINE_ENABLE_HAMMER_LP, CAL_PI_REFINE_SETTLE_SAMPLES_HAMMER_LP },
};
#endif

static int32 cal_counts_error_to_dac_scale(int32 error_counts)
{
    return cal_round_div_i64((int64)error_counts * (int64)CAL_ADC_SPAN_MV * (int64)CAL_VDAC_LEVELS,
                             (int64)CAL_ADC_LEVELS * (int64)CAL_VDAC_QUANT_SPAN_MV);
}

static int32 cal_pi_stage_gain_x1000(uint8 stage_index)
{
    int32 configured_gain = g_cal_pi_cfg[stage_index].gain_x1000;

    if (configured_gain == 0L && stage_index == 0u) {
        int32 pga_gain = (int32)psoc_hw_pga_gain_x1000();
        return 1000L - pga_gain;
    }
    return configured_gain;
}

static int32 cal_pi_deadband_dac_codes(uint8 stage_index)
{
#ifdef CAL_PI_FORCE_MIN_DEADBAND
    (void)stage_index;
    return CAL_PI_DEADBAND_MIN_DAC_CODES;
#else
    int32 deadband = g_cal_pi_cfg[stage_index].deadband_dac;
    int32 gain_x1000;
    int64 num;
    int64 den;

    if (deadband <= 0L) {
        gain_x1000 = cal_pi_stage_gain_x1000(stage_index);
        if (gain_x1000 < 0L) {
            gain_x1000 = -gain_x1000;
        }
        num = (int64)gain_x1000 * (int64)CAL_PI_DEADBAND_MARGIN_NUM;
        den = 1000LL * (int64)CAL_PI_DEADBAND_MARGIN_DEN;
        deadband = (int32)((num + den - 1LL) / den);
    }
    if (deadband < CAL_PI_DEADBAND_MIN_DAC_CODES) {
        deadband = CAL_PI_DEADBAND_MIN_DAC_CODES;
    }
    return deadband;
#endif
}

static int32 cal_pi_error_bucket(int32 error_dac, int32 deadband_dac)
{
    int32 abs_error;
    int32 span;
    int32 bucket;

    span = (deadband_dac <= 0L) ? 1L : deadband_dac;
    abs_error = abs_counts(error_dac);
    if (abs_error <= span) {
        return 0L;
    }
    bucket = 1L + ((abs_error - span - 1L) / span);
    return (error_dac < 0L) ? -bucket : bucket;
}

static uint8 cal_pi_measurement_valid(int32 measured)
{
    return (measured >= CAL_ADC_SIGNED_MIN_COUNTS &&
            measured <= CAL_ADC_SIGNED_MAX_COUNTS) ? 1u : 0u;
}

static uint8 cal_stage_measure_current(uint8 stage_index, uint8 dac, int32 *measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[stage_index];

    ADC_Stop();
    CAL_AMUX_ADC_SELECT(stage->adc_channel);
    ADC_Start();
    stage->write(dac);
    CyDelay(CAL_DIAG_SWEEP_SETTLE_MS);
    if (measured != (int32 *)0) {
        *measured = cal_adc_read_direct_counts();
    }
    return 1u;
}

