simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogicoTest/AcondicionamientoAnalogico.cydsn/calibration.c
static uint8 cal_stage_value_in_tolerance(uint8 stage_index, int32 measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[stage_index];
    int32 control_sample = cal_pi_compare_counts(measured);
    int32 error_counts = stage->target_counts - control_sample;
    int32 error_dac = cal_counts_error_to_dac_scale(error_counts);
    int32 deadband_dac = cal_pi_deadband_dac_codes(stage_index);

    return (abs_counts(error_dac) <= deadband_dac &&
            cal_pi_measurement_valid(measured)) ? 1u : 0u;
}

static uint8 cal_verify_seeded_values(void)
{
    uint8 i;
    uint8 all_ok = 1u;

    cal_diag(PSOC_EVT_BOOT, PSOC_HW_CLASS);
    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;

    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        const PsocCalStage *stage = &g_psoc_cal_stages[i];
        PsocCalResult *result = &g_psoc_cal_results[i];
        uint8 dac = cal_stage_current_dac(i);
        int32 measured = 0L;
        uint8 ok;

        cal_diag(PSOC_EVT_CAL_STAGE_BEGIN, i);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_TARGET32, stage->target_counts);

        (void)cal_stage_measure_current(i, dac, &measured);
        ok = cal_stage_value_in_tolerance(i, measured);

        result->final_dac = dac;
        result->final_measured = measured;
        result->ok = ok;

        cal_diag(PSOC_EVT_CAL_STAGE_DAC, result->final_dac);
        cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, result->final_measured);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, result->final_measured);
        cal_diag(PSOC_EVT_CAL_STAGE_OK, result->ok);

        if (!ok) {
            all_ok = 0u;
        }
    }

    psoc_calibration_restore_capture_path();
    return all_ok;
}

static int32 cal_pi_abs_error_counts(const PsocCalStage *stage, int32 measured)
{
    int32 control_sample = cal_pi_compare_counts(measured);
    return abs_counts(stage->target_counts - control_sample);
}

static int32 cal_pi_gain_scaled_term(int32 value, int32 num, int32 div, int32 gain_x1000)
{
    int32 sign = 1L;

    if (div == 0L) {
        div = 1L;
    }
    if (gain_x1000 < 0L) {
        sign = -1L;
        gain_x1000 = -gain_x1000;
    }
    if (gain_x1000 == 0L) {
        gain_x1000 = 1000L;
    }
    return sign * cal_round_div_i64((int64)value * (int64)num * 1000LL,
                                    (int64)div * (int64)gain_x1000);
}

static int8 cal_pi_effort_delta_sign(int32 control_error, int8 direction, int32 gain_x1000)
{
    int8 sign;

    if (control_error == 0L || direction == 0 || gain_x1000 == 0L) {
        return 0;
    }

    sign = (control_error > 0L) ? 1 : -1;
    if (direction < 0) {
        sign = (int8)-sign;
    }
    if (gain_x1000 < 0L) {
        sign = (int8)-sign;
    }
    return sign;
}

static uint8 cal_pi_finalize_stage(uint8 ok, uint8 final_dac, int32 final_measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    PsocCalResult *result = &g_psoc_cal_results[g_cal_async.stage_index];
    uint8 final_pass;

    final_dac = cal_stage_clamp_dac(stage, final_dac);
    stage->write(final_dac);
    result->final_dac = final_dac;
    result->final_measured = final_measured;
    result->ok = ok;
    final_pass = ((uint8)(g_cal_async.pass_index + 1u) >= (uint8)CAL_PI_PASS_COUNT) ? 1u : 0u;
    if (!ok && final_pass) {
        g_cal_async.ok = 0u;
    }

    cal_diag(PSOC_EVT_CAL_STAGE_DAC, result->final_dac);
    cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, result->final_measured);
    cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, result->final_measured);
    cal_diag(PSOC_EVT_CAL_STAGE_OK, result->ok);

    g_cal_async.stage_index++;
    if (g_cal_async.stage_index >= PSOC_CAL_STAGE_COUNT) {
        if (!final_pass) {
            g_cal_async.pass_index++;
            g_cal_async.stage_index = 0u;
            g_cal_pi.state = CAL_PI_STAGE_BEGIN;
            return 0u;
        }
        cal_async_complete();
        return 1u;
    }
    g_cal_pi.state = CAL_PI_STAGE_BEGIN;
    return 0u;
}

/* Cierra la etapa con lo que el lazo ya tiene y agrega un unico refinamiento
 * de cuantizacion: probar el LSB que deberia reducir el error fisico; si no
 * mejora el error absoluto medido por el FIR, vuelve al DAC anterior. */
static uint8 cal_pi_finish_stage(uint8 ok)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    const PsocCalPiCfg *cfg = &g_cal_pi_cfg[g_cal_async.stage_index];
    int32 stage_gain_x1000;
    int32 control_sample;
    int32 error_counts;
    int8 step_sign;
    uint8 dac_lo;
    uint8 dac_hi;
    uint8 trial_dac;

    if (!cfg->refine_enable || !ok || !cal_pi_measurement_valid(g_cal_pi.last_fir_output)) {
        return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
    }

    stage_gain_x1000 = cal_pi_stage_gain_x1000(g_cal_async.stage_index);
    if (stage_gain_x1000 == 0L) {
        return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
    }

    control_sample = cal_pi_compare_counts(g_cal_pi.last_fir_output);
    error_counts = stage->target_counts - control_sample;
    step_sign = cal_pi_effort_delta_sign(error_counts, stage->direction, stage_gain_x1000);
    if (step_sign == 0) {
        return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
    }

    dac_lo = cal_stage_min_dac(stage);
    dac_hi = cal_stage_max_dac(stage);
    if (step_sign > 0) {
        if (g_cal_pi.dac_current >= dac_hi) {
            return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
        }
        trial_dac = (uint8)(g_cal_pi.dac_current + 1u);
    } else {
        if (g_cal_pi.dac_current <= dac_lo) {
            return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
        }
        trial_dac = (uint8)(g_cal_pi.dac_current - 1u);
    }

    g_cal_pi.refine_ok = ok;
    g_cal_pi.refine_base_dac = g_cal_pi.dac_current;
    g_cal_pi.refine_trial_dac = trial_dac;
    g_cal_pi.refine_base_measured = g_cal_pi.last_fir_output;
    g_cal_pi.refine_base_abs_error = cal_pi_abs_error_counts(stage, g_cal_pi.last_fir_output);
    g_cal_pi.settle_remaining = cfg->refine_settle_samples;
    g_cal_pi.empty_polls = 0UL;
    g_cal_pi.dac_current = trial_dac;
    stage->write(trial_dac);
    g_cal_pi.state = CAL_PI_REFINE_SETTLE;
    return 0u;
}

static void cal_pi_stage_begin(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    const PsocCalPiCfg *cfg = &g_cal_pi_cfg[g_cal_async.stage_index];
    int32 stage_gain_x1000;
    int32 deadband_dac;

