simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogicoTest/AcondicionamientoAnalogico.cydsn/calibration.c
    cal_diag(PSOC_EVT_CAL_STAGE_BEGIN, g_cal_async.stage_index);
    cal_diag_i32(PSOC_EVT_CAL_STAGE_TARGET32, stage->target_counts);
    stage_gain_x1000 = cal_pi_stage_gain_x1000(g_cal_async.stage_index);
    deadband_dac = cal_pi_deadband_dac_codes(g_cal_async.stage_index);
    cal_diag_i32(PSOC_EVT_CAL_PI_GAIN32, stage_gain_x1000);
    cal_diag(PSOC_EVT_CAL_PI_DEADBAND,
             (deadband_dac > 255L) ? 255u : (uint8)deadband_dac);

    g_cal_pi.integral = 0L;
    g_cal_pi.samples_taken = 0u;
    g_cal_pi.stable_count = 0u;
    g_cal_pi.have_last_error = 0u;
    g_cal_pi.last_error_dac = 0L;
    g_cal_pi.last_error_bucket = 0L;
    g_cal_pi.last_dac_target = 0u;
    g_cal_pi.last_fir_output = 0L;
    g_cal_pi.empty_polls = 0UL;
    g_cal_pi.settle_remaining = cfg->settle_samples;
    g_cal_pi.refine_base_measured = 0L;
    g_cal_pi.refine_base_abs_error = 0L;
    g_cal_pi.refine_base_dac = 0u;
    g_cal_pi.refine_trial_dac = 0u;
    g_cal_pi.refine_ok = 0u;
    g_cal_pi.base_dac = cal_stage_current_dac(g_cal_async.stage_index);
    g_cal_pi.dac_current = g_cal_pi.base_dac;
    stage->write(g_cal_pi.dac_current);

    ADC_Stop();
    CAL_AMUX_ADC_SELECT_STAGE(stage->adc_channel);
    cal_diag(PSOC_EVT_CAL_AMUX_IN, stage->adc_channel);
#if CAL_AMUX_HAS_CAP_CHANNEL
    cal_diag(PSOC_EVT_CAL_AMUX_CAP, CAL_AMUX_CAP_CHANNEL);
#endif
    ADC_Start();

    stage->write(g_cal_pi.dac_current);

    /* El PI no promedia/EMA en software: extrae el DC con el FIR de hardware
     * (Canal A del Filter, coeficientes de FIR_calibration.h cargados en
     * cal_pi_start) -- ADC -> Filter_STAGEA -> DMA_Filter_RAM, leido muestra
     * a muestra en cal_pi_run_service. */
    dma_route_select(1u);
    psoc_filter_reset_history();
    psoc_adc_clear_isr_filtered_sample();
#ifdef CY_ISR_isr_DMA_Filter_RAM_H
    isr_DMA_Filter_RAM_ClearPending();
#endif
    ADC_StartConvert();

    g_cal_pi.state = (g_cal_pi.settle_remaining == 0u) ? CAL_PI_RUN : CAL_PI_SETTLE;
}

static uint8 cal_pi_settle_service(void)
{
    int32 sample;

    if (!psoc_adc_take_isr_filtered_sample(&sample)) {
        g_cal_pi.empty_polls++;
        if (g_cal_pi.empty_polls >= CAL_ASYNC_EMPTY_POLL_LIMIT) {
            return cal_pi_finish_stage(0u);
        }
        return 0u;
    }

    g_cal_pi.empty_polls = 0UL;
    g_cal_pi.last_fir_output = sample;

    if (g_cal_pi.settle_remaining > 0u) {
        g_cal_pi.settle_remaining--;
    }
    if (g_cal_pi.settle_remaining == 0u) {
        g_cal_pi.integral = 0L;
        g_cal_pi.samples_taken = 0u;
        g_cal_pi.stable_count = 0u;
        g_cal_pi.have_last_error = 0u;
        g_cal_pi.last_error_dac = 0L;
        g_cal_pi.last_error_bucket = 0L;
        g_cal_pi.empty_polls = 0UL;
        g_cal_pi.state = CAL_PI_RUN;
    }

    return 0u;
}

static uint8 cal_pi_refine_service(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    int32 sample;
    int32 trial_abs_error;

    if (!psoc_adc_take_isr_filtered_sample(&sample)) {
        g_cal_pi.empty_polls++;
        if (g_cal_pi.empty_polls >= CAL_ASYNC_EMPTY_POLL_LIMIT) {
            stage->write(g_cal_pi.refine_base_dac);
            g_cal_pi.dac_current = g_cal_pi.refine_base_dac;
            g_cal_pi.last_fir_output = g_cal_pi.refine_base_measured;
            return cal_pi_finalize_stage(g_cal_pi.refine_ok,
                                         g_cal_pi.refine_base_dac,
                                         g_cal_pi.refine_base_measured);
        }
        return 0u;
    }

    g_cal_pi.empty_polls = 0UL;
    g_cal_pi.last_fir_output = sample;

    if (g_cal_pi.settle_remaining > 0u) {
        g_cal_pi.settle_remaining--;
    }
    if (g_cal_pi.settle_remaining != 0u) {
        return 0u;
    }

    trial_abs_error = cal_pi_abs_error_counts(stage, sample);
    if (trial_abs_error < g_cal_pi.refine_base_abs_error &&
        cal_pi_measurement_valid(sample)) {
        g_cal_pi.dac_current = g_cal_pi.refine_trial_dac;
        return cal_pi_finalize_stage(g_cal_pi.refine_ok,
                                     g_cal_pi.refine_trial_dac,
                                     sample);
    }

    stage->write(g_cal_pi.refine_base_dac);
    g_cal_pi.dac_current = g_cal_pi.refine_base_dac;
    g_cal_pi.last_fir_output = g_cal_pi.refine_base_measured;
    return cal_pi_finalize_stage(g_cal_pi.refine_ok,
                                 g_cal_pi.refine_base_dac,
                                 g_cal_pi.refine_base_measured);
}

static uint8 cal_pi_run_service(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    const PsocCalPiCfg *cfg = &g_cal_pi_cfg[g_cal_async.stage_index];
    int32 sample;
    int32 control_sample;
    int32 error_counts;
    int32 error_dac;
    int32 control_error;
    int32 effort;
    int32 p_term;
    int32 i_term;
    int32 stage_gain_x1000;
    int32 deadband_dac;
    int32 error_bucket;
    int32 dac_max_step_up;
    int32 dac_max_step_down;
    uint16 sample_index;
    uint16 lock_n;
    uint8 dac_sample;
    uint8 dac_lo;
    uint8 dac_hi;
    uint8 dac_target;
    uint8 dac_step;
    uint8 can_integrate;
    uint8 dac_changed;
    int8 effort_delta_sign;

    if (!psoc_adc_take_isr_filtered_sample(&sample)) {
        g_cal_pi.empty_polls++;
        if (g_cal_pi.empty_polls >= CAL_ASYNC_EMPTY_POLL_LIMIT) {
            return cal_pi_finish_stage(0u);
        }
        return 0u;
    }
    g_cal_pi.empty_polls = 0UL;

    /* Sin promediado/EMA en software: el FIR de hardware (Canal A del
     * Filter, FIR_calibration.h) ya extrajo el DC -- fir_output es
     * directamente la muestra filtrada. */
    g_cal_pi.last_fir_output = sample;
    control_sample = cal_pi_compare_counts(g_cal_pi.last_fir_output);
    error_counts = stage->target_counts - control_sample;
    error_dac = cal_counts_error_to_dac_scale(error_counts);
    stage_gain_x1000 = cal_pi_stage_gain_x1000(g_cal_async.stage_index);
    deadband_dac = cal_pi_deadband_dac_codes(g_cal_async.stage_index);
    control_error = (abs_counts(error_dac) <= deadband_dac) ? 0L : error_dac;
    error_bucket = cal_pi_error_bucket(error_dac, deadband_dac);
    dac_sample = g_cal_pi.dac_current;

