simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogicoTest/AcondicionamientoAnalogico.cydsn/calibration.c
    if (psoc_cal_timer_take_watchdog_due()) {
        cal_async_abort_watchdog();
        return 1u;
    }
    if (psoc_cal_timer_take_progress_due()) {
        cal_diag(PSOC_EVT_CAL_PROGRESS, g_cal_async.stage_index);
    }

    return cal_pi_service();   /* unico camino de calibracion */
}

/* ==========================================================================
 * PRIMITIVAS DE AUTOTEST  (proyecto AcondicionamientoAnalogicoTest)
 * --------------------------------------------------------------------------
 * Este bloque existe SOLO en el proyecto de test. Expone hacia main.c
 * (via psoc_selftest.h) las primitivas de medicion que ya usaba la
 * calibracion, porque el AMux y el lector de ADC son static en este archivo
 * y el autotest los necesita para barrer IDAC contra cada tap del AMux.
 *
 * No se agrega ningun .c nuevo al proyecto: el .cyprj no se toca a mano.
 * ========================================================================== */


/* Sin libm: agregar -lm al link obliga a editar el .cyprj, y ese archivo no
 * se toca a mano. Estas tres funciones cubren lo unico que hacia falta.
 * Solo usan +, -, * y /, que resuelve libgcc. */

/* Raiz cuadrada entera por Newton sobre uint64. Alcanza de sobra: todo lo que
 * se reporta termina redondeado a microvolts enteros. */
static uint32 st_isqrt64(uint64 x)
{
    uint64 r, prev;
    if (x == 0u) { return 0u; }
    /* Semilla: 2^(ceil(bits/2)) */
    r = x;
    prev = 0u;
    {
        uint32 bits = 0u;
        uint64 t = x;
        while (t != 0u) { t >>= 1; bits++; }
        r = (uint64)1u << ((bits + 1u) / 2u);
    }
    /* Newton: r <- (r + x/r)/2, converge en pocas vueltas y es monotona. */
    while (r != prev) {
        prev = r;
        r = (r + x / r) / 2u;
        if (r == 0u) { return 0u; }
        /* corta oscilacion entre dos valores adyacentes */
        if (prev > r && (prev - r) == 1u) { break; }
    }
    while (r * r > x) { r--; }
    return (uint32)r;
}

/* Coseno y seno por Taylor con reduccion de rango a [-pi/4, pi/4].
 * El Goertzel del autotest usa w = 2*pi*f0/fs; con f0 = 50 Hz y fs = 2604 Hz
 * queda w = 0.1207 rad, comodamente dentro del rango donde 5 terminos dan
 * mas precision de la que necesita una medida de ruido. La reduccion esta
 * igual para que siga siendo correcto si se cambia la frecuencia. */
#define ST_PI      3.14159265358979323846
#define ST_TWO_PI  6.28318530717958647692
#define ST_HALF_PI 1.57079632679489661923

static double st_cos_core(double x)   /* |x| <= pi/4 */
{
    double x2 = x * x;
    return 1.0 - x2 * (1.0 / 2.0
         - x2 * (1.0 / 24.0
         - x2 * (1.0 / 720.0
         - x2 * (1.0 / 40320.0
         - x2 * (1.0 / 3628800.0)))));
}

static double st_sin_core(double x)   /* |x| <= pi/4 */
{
    double x2 = x * x;
    return x * (1.0 - x2 * (1.0 / 6.0
              - x2 * (1.0 / 120.0
              - x2 * (1.0 / 5040.0
              - x2 * (1.0 / 362880.0)))));
}

/* Reduce a [0, 2pi) y despacha por octante usando las identidades
 * sin(x+pi/2)=cos(x) y cos(x+pi/2)=-sin(x). */
static void st_sincos(double x, double *out_sin, double *out_cos)
{
    int quad;
    double r;

    while (x < 0.0)        { x += ST_TWO_PI; }
    while (x >= ST_TWO_PI) { x -= ST_TWO_PI; }

    quad = (int)(x / ST_HALF_PI);   /* 0..3 */
    r = x - (double)quad * ST_HALF_PI;

    /* Dentro del cuadrante, si r > pi/4 se usa el complemento para que el
     * argumento del Taylor nunca pase de pi/4. */
    if (r > (ST_HALF_PI / 2.0)) {
        double c = ST_HALF_PI - r;
        double sc = st_sin_core(c);
        double cc = st_cos_core(c);
        /* Con c = pi/2 - r, o sea r = pi/2 - c, y x = quad*pi/2 + r:
         *   quad 0: sin(r)        =  cos(c)   cos(r)        =  sin(c)
         *   quad 1: sin(pi/2+r)   =  sin(c)   cos(pi/2+r)   = -cos(c)
         *   quad 2: sin(pi+r)     = -cos(c)   cos(pi+r)     = -sin(c)
         *   quad 3: sin(3pi/2+r)  = -sin(c)   cos(3pi/2+r)  =  cos(c)
         * Los cuadrantes 1 y 3 estaban intercambiados: devolvia el seno y el
         * coseno con los dos signos dados vuelta. No afectaba a la medicion de
         * 50 Hz (w = 0,12 rad cae en el cuadrante 0 y por la otra rama), pero
         * corrompia la magnitud del Goertzel para cualquier tono por encima de
         * ~325 Hz. */
        switch (quad) {
            case 0:  *out_sin =  cc; *out_cos =  sc; break;
            case 1:  *out_sin =  sc; *out_cos = -cc; break;
            case 2:  *out_sin = -cc; *out_cos = -sc; break;
            default: *out_sin = -sc; *out_cos =  cc; break;
        }
    } else {
        double sr = st_sin_core(r);
        double cr = st_cos_core(r);
        switch (quad) {
            case 0:  *out_sin =  sr; *out_cos =  cr; break;
            case 1:  *out_sin =  cr; *out_cos = -sr; break;
            case 2:  *out_sin = -sr; *out_cos = -cr; break;
            default: *out_sin = -cr; *out_cos =  sr; break;
        }
    }
}

/* Rango de entrada a fondo de escala de cada config del ADC, en microvolts.
 * 18 bits con signo -> +-131072 counts a fondo de escala. */
#define SELFTEST_ADC_FS_COUNTS 131072L

/* Muestras que se usan para estimar la continua antes del Goertzel. */
#define ST_DC_PRE_SAMPLES 64u

static int32 selftest_config_range_uv(void)
{
    switch (psoc_adc_get_config())
    {
        case 2u:  return 512000L;    /* ADC_CF_0V512 */
        case 3u:  return 1024000L;   /* ADC_CF_1V024 */
        case 4u:  return 625000L;    /* ADC_CF_0V625 */
        case 1u:
        default:  return 2500000L;   /* ADC_CF_2V5 */
    }
}

/* Lectura del ADC que SI distingue "no convirtio" de "convirtio cero".
 * cal_adc_read_direct_counts() devuelve 0 al vencer el guard, y eso es
 * indistinguible de una medicion legitima de 0 V. Para el autotest esa
 * ambiguedad es inaceptable: convierte un ADC muerto en un PASS. */
static uint8 st_adc_read_checked(int32 *out)
{
    uint16 guard;
    uint8 ready = 0u;

    if (out == (int32 *)0) { return 0u; }

    ADC_StopConvert();
    ADC_StartConvert();
    for (guard = 0u; guard < (uint16)CAL_ADC_DIRECT_WAIT_POLLS; guard++) {
        if (ADC_IsEndConversion(ADC_RETURN_STATUS)) { ready = 1u; break; }
    }
    if (!ready) {
        ADC_StopConvert();
        return 0u;
    }
    *out = psoc_adc_counts_right_aligned(ADC_GetResult32());
    ADC_StopConvert();
    return 1u;
}

int32 psoc_selftest_counts_to_uv(int32 counts)
{
    int64 num = (int64)counts * (int64)selftest_config_range_uv();
    return (int32)(num / (int64)SELFTEST_ADC_FS_COUNTS);
}

uint8 psoc_selftest_stage_count(void)
{
    return PSOC_CAL_STAGE_COUNT;
}

uint8 psoc_selftest_stage_channel(uint8 stage, uint8 *out_channel)
{
    if (stage >= PSOC_CAL_STAGE_COUNT || out_channel == (uint8 *)0) { return 0u; }
    *out_channel = g_psoc_cal_stages[stage].adc_channel;
    return 1u;
}

