simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogicoTest/AcondicionamientoAnalogico.cydsn/calibration.c
uint8 psoc_selftest_amux_channel_count(void)
{
    return (uint8)AMux_ADC_CHANNELS;
}

/* Escribe el IDAC de la etapa SIN clamp: el barrido del autotest necesita
 * poder recorrer 0..255 completo, no el rango acotado que usa el PI. */
uint8 psoc_selftest_write_stage_dac(uint8 stage, uint8 code)
{
    if (stage >= PSOC_CAL_STAGE_COUNT) { return 0u; }
    g_psoc_cal_stages[stage].write(code);
    return 1u;
}

uint8 psoc_selftest_current_stage_dac(uint8 stage, uint8 *out_code)
{
    if (stage >= PSOC_CAL_STAGE_COUNT || out_code == (uint8 *)0) { return 0u; }
    *out_code = cal_stage_current_dac(stage);
    return 1u;
}

uint8 psoc_selftest_stage_result(uint8 stage, uint8 *out_dac, int32 *out_meas, uint8 *out_ok)
{
    if (stage >= PSOC_CAL_STAGE_COUNT || stage >= g_psoc_cal_result_count) { return 0u; }
    if (out_dac  != (uint8 *)0) { *out_dac  = g_psoc_cal_results[stage].final_dac; }
    if (out_meas != (int32 *)0) { *out_meas = g_psoc_cal_results[stage].final_measured; }
    if (out_ok   != (uint8 *)0) { *out_ok   = g_psoc_cal_results[stage].ok; }
    return 1u;
}

/* Selecciona un canal del AMux de forma exclusiva y deja el ADC corriendo.
 * with_cap conecta ademas el canal del capacitor (mismo criterio que usa la
 * calibracion para medir una etapa). */
void psoc_selftest_select_channel(uint8 channel, uint8 with_cap)
{
    /* Pedir el capacitor EN PARALELO al propio canal del capacitor no tiene
     * sentido y ademas confunde a los dos trackers, que apuntarian al mismo
     * canal fisico con dos significados distintos. */
#if CAL_AMUX_HAS_CAP_CHANNEL
    if (channel == CAL_AMUX_CAP_CHANNEL) { with_cap = 0u; }
#endif
    ADC_Stop();
    psoc_amux_select_exclusive(channel, with_cap);
    ADC_Start();
}

void psoc_selftest_restore(void)
{
    psoc_calibration_restore_capture_path();
}

/* Medicion DC de un canal: promedio de n conversiones completas y
 * reiniciadas (cada una asienta el decimador del DelSig por si sola, que es
 * lo correcto despues de conmutar el AMux). Devuelve media y pico-pico en
 * counts right-aligned. */
uint8 psoc_selftest_measure_dc(uint8 channel, uint16 settle_ms, uint16 n,
                               uint8 with_cap, int32 *out_mean, int32 *out_pp)
{
    int64 sum = 0;
    int32 vmin = 0, vmax = 0;
    uint16 i;

    if (n == 0u || out_mean == (int32 *)0) { return 0u; }

    psoc_selftest_select_channel(channel, with_cap);
    if (settle_ms > 0u) { CyDelay(settle_ms); }

    for (i = 0u; i < n; i++) {
        int32 s;
        if (!st_adc_read_checked(&s)) {
            /* El ADC no convirtio. Abortar: devolver ceros seria decir "0 V,
             * perfectamente estable" sobre una placa rota. */
            psoc_selftest_restore();
            return 0u;
        }
        sum += (int64)s;
        if (i == 0u) { vmin = s; vmax = s; }
        else {
            if (s < vmin) { vmin = s; }
            if (s > vmax) { vmax = s; }
        }
    }

    *out_mean = (int32)(sum / (int64)n);
    if (out_pp != (int32 *)0) { *out_pp = vmax - vmin; }
    return 1u;
}

/* Serie continua para el piso de ruido: no reinicia la conversion entre
 * muestras, asi que respeta la Fs nativa y sirve para estimar amplitud a una
 * frecuencia dada. Calcula todo en streaming (sin buffer): media, RMS,
 * pico-pico y la amplitud a tone_hz por Goertzel.
 *
 * Salidas en counts; el RMS y la amplitud son magnitudes de AC (media ya
 * restada en el caso del RMS). */
uint8 psoc_selftest_measure_series(uint8 channel, uint16 settle_ms, uint16 n,
                                   uint8 with_cap, uint16 tone_hz,
                                   int32 *out_mean, int32 *out_rms,
                                   int32 *out_pp, int32 *out_tone)
{
    int64 sum = 0;
    int64 sumsq = 0;
    int32 vmin = 0, vmax = 0;
    uint16 i;
    uint16 got = 0u;
    double w, cw, sw, coeff;
    double s0 = 0.0, s1 = 0.0, s2 = 0.0;
    double dc_est = 0.0;

    if (n == 0u || out_mean == (int32 *)0) { return 0u; }

    psoc_selftest_select_channel(channel, with_cap);
    if (settle_ms > 0u) { CyDelay(settle_ms); }

    /* Goertzel: k = n*f0/fs, w = 2*pi*k/n = 2*pi*f0/fs */
    w = ST_TWO_PI * (double)tone_hz / (double)PSOC_ADC_NATIVE_FS_HZ;
    st_sincos(w, &sw, &cw);
    coeff = 2.0 * cw;

    /* Descarta las primeras conversiones: el decimador del DelSig arrastra
     * historia del canal anterior. */
    (void)cal_adc_read_direct_counts();

    /* Estimacion de continua para restarsela al Goertzel.
     *
     * Con N multiplo de la Fs el bin cae exacto y la continua se rechaza sola,
     * pero esto cubre el caso de que alguien pida un N cualquiera: sin restarla,
     * la fuga de un offset de decenas de miles de counts (lo normal en un tap
     * sin calibrar) se mide como si fuera senal a 50 Hz. Se estima con las
     * primeras muestras, que es suficiente porque la continua no se mueve en
     * el segundo que dura la medicion. */
    {
        int32 dcs;
        uint16 g2;
        uint16 got_dc = 0u;
        int64 dcsum = 0;
        ADC_StopConvert();
        ADC_StartConvert();
        for (dcs = 0; dcs < (int32)ST_DC_PRE_SAMPLES; dcs++) {
            uint8 rdy = 0u;
            for (g2 = 0u; g2 < (uint16)CAL_ADC_DIRECT_WAIT_POLLS; g2++) {
                if (ADC_IsEndConversion(ADC_RETURN_STATUS)) { rdy = 1u; break; }
            }
            if (!rdy) { break; }
            dcsum += (int64)psoc_adc_counts_right_aligned(ADC_GetResult32());
            got_dc++;
        }
        ADC_StopConvert();
        if (got_dc > 0u) { dc_est = (double)dcsum / (double)got_dc; }
    }

    ADC_StopConvert();
    ADC_StartConvert();
    for (i = 0u; i < n; i++) {
        int32 s;
        uint16 guard;
        uint8 ready = 0u;

        for (guard = 0u; guard < (uint16)CAL_ADC_DIRECT_WAIT_POLLS; guard++) {
            if (ADC_IsEndConversion(ADC_RETURN_STATUS)) { ready = 1u; break; }
        }
        if (!ready) {
            /* Corte a mitad de serie: la ventana ya no es la pedida, asi que
             * ni la normalizacion del Goertzel ni el RMS son comparables con
             * nada. Se aborta en vez de devolver numeros que parecen validos. */
            ADC_StopConvert();
            psoc_selftest_restore();
            return 0u;
        }

        s = psoc_adc_counts_right_aligned(ADC_GetResult32());
        sum += (int64)s;
        sumsq += (int64)s * (int64)s;
        if (got == 0u) { vmin = s; vmax = s; }
        else {
            if (s < vmin) { vmin = s; }
            if (s > vmax) { vmax = s; }
        }

        s0 = coeff * s1 - s2 + ((double)s - dc_est);
        s2 = s1;
        s1 = s0;
        got++;
    }
    ADC_StopConvert();

    /* Se exige la ventana COMPLETA: ver el comentario del corte de arriba. */
    if (got != n) { psoc_selftest_restore(); return 0u; }

    *out_mean = (int32)((double)sum / (double)got);

    if (out_pp != (int32 *)0) { *out_pp = vmax - vmin; }

    if (out_rms != (int32 *)0) {
        /* var = E[x^2] - E[x]^2, en double para no perder la resta. */
        double ex2 = (double)sumsq / (double)got;
        double ex  = (double)sum / (double)got;
        double var = ex2 - ex * ex;
        if (var < 0.0) { var = 0.0; }
        *out_rms = (int32)st_isqrt64((uint64)var);
    }

    if (out_tone != (int32 *)0) {
        /* Magnitud del bin, normalizada a amplitud de pico. El termino DC no
         * molesta porque Goertzel a f0 != 0 lo rechaza solo salvo fuga; con n
         * grande alcanza. */
        double re = s1 - s2 * cw;
        double im = s2 * sw;
        double p  = re * re + im * im;
        if (p < 0.0) { p = 0.0; }
        *out_tone = (int32)(2.0 * (double)st_isqrt64((uint64)p) / (double)got);
    }

    return 1u;
}
